---
type: FillGrid
namespace: Autodesk.Revit.DB
version: 2024
members: 17
tags: [revit-api, class]
---

# FillGrid

`Autodesk.Revit.DB.FillGrid` · Revit 2024 · 17 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FillGrid | — | `` |
| Constructor | FillGrid | 2012 | `public FillGrid ()` |
| Method | CalculateLengthPerArea | 2012 | `public double CalculateLengthPerArea ()` |
| Method | CalculateLinesPerLength | 2012 | `public double CalculateLinesPerLength ()` |
| Method | CalculateStrokesPerArea | 2012 | `public double CalculateStrokesPerArea ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetHatchingDirection | 2012 | `public UV GetHatchingDirection ()` |
| Method | GetPointLineZone | — | `` |
| Method | GetSegmentDirection | 2012 | `public UV GetSegmentDirection ()` |
| Method | GetSegments | 2012 | `public IList < double > GetSegments ()` |
| Method | IsEqual | 2012 | `public bool IsEqual ( FillGrid other )` |
| Method | SetSegments | 2012 | `public void SetSegments ( IList < double > segArr )` |
| Property | Angle | 2012 | `public double Angle { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Offset | 2012 | `public double Offset { get ; set ; }` |
| Property | Origin | 2012 | `public UV Origin { get ; set ; }` |
| Property | Shift | 2012 | `public double Shift { get ; set ; }` |